var ART = [
    "{\\__/}\n" + "(●_●)\n" + "( > 🍪 Want a cookie?",
    "⠀⠀⠀⠀⠀⠀⠀⠀⢀⣞⣆⢀⣠⢶⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ \n" +
      "⠀⢀⣀⡤⠤⠖⠒⠋⠉⣉⠉⠹⢫⠾⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
      "⢠⡏⢰⡴⠀⠀⠀⠉⠙⠟⠃⠀⠀⠀⠈⠙⠦⣄⡀⢀⣀⣠⡤⠤⠶⠒⠒⢿⠋⠈⠀⣒⡒⠲⠤⣄⡀⠀⠀\n" +
      "⢸⠀⢸⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠀⠴⠂⣀⠀⠀⣴⡄⠉⢷⡄⠚⠀⢤⣒⠦⠉⠳⣄⡀⠀\n" +
      "⠸⡄⠼⠦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣄⡂⠠⣀⠐⠍⠂⠙⣆⠀\n" +
      "⠀⠙⠦⢄⣀⣀⣀⣀⡀⠀⢷⠀⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⡇⠠⣀⠱⠘⣧\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠈⠉⢷⣧⡄⢼⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⡈⠀⢄⢸⡄\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣿⡀⠃⠘⠂⠲⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠀⡈⢘⡇\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢫⡑⠣⠰⠀⢁⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⣸⠁\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣯⠂⡀⢨⠀⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡆⣾⡄⠀⠀⠀⠀⣀⠐⠁⡴⠁\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣧⡈⡀⢠⣧⣤⣀⣀⡀⢀⡀⠀⠀⢀⣼⣀⠉⡟⠀⢀⡀⠘⢓⣤⡞⠁\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢺⡁⢁⣸⡏⠀⠀⠀⠀⠁⠀⠉⠉⠁⠹⡟⢢⢱⠀⢸⣷⠶⠻⡇⠀⠀⠀\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⡏⠈⡟⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⢄⠁⠀⠻⣧⠀⠀⣹⠁⠀  \n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⡤⠚⠃⣰⣥⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⠼⢙⡷⡻⠀⡼⠁⠀⠀⠀\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠟⠿⡿⠕⠊⠉⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣶⣾⠉⣹⣷⣟⣚⣁⡼⠁⠀⠀⠀\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠙⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
    "⠀⠀⠀⠀⣠⣶⡾⠏⠉⠙⠳⢦⡀⠀⠀⠀⢠⠞⠉⠙⠲⡀⠀\n" +
      "⠀⠀⠀⣴⠿⠏⠀⠀⠀⠀⠀ ⠀⢳⡀⠀ ⡏⠀⠀⠀⠀⠀⢷\n" +
      "⠀⠀⢠⣟⣋⡀⢀⣀⣀⡀⠀⣀⡀⣧⠀⢸⠀⠀⠀⠀⠀ ⡇\n" +
      "  ⢸⣯⡭⠁⠸⣛⣟⠆⡴⣻⡲⣿ ⣸  OK   ⡇\n" +
      "⠀⠀⣟⣿⡭⠀⠀⠀⠀⠀⢱⠀⠀⣿⠀ ⢹⠀⠀⠀⠀⠀ ⡇\n" +
      "⠀⠀⠙⢿⣯⠄⠀⠀⠀⢀⡀⠀⠀⡿⠀⠀⡇⠀⠀⠀⠀⡼\n" +
      "⠀⠀⠀⠀⠹⣶⠆⠀⠀⠀⠀⠀⡴⠃⠀⠀⠘⠤⣄⣠⠞⠀\n" +
      "⠀⠀⠀⠀⠀⢸⣷⡦⢤⡤⢤⣞⣁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
      "⠀⠀⢀⣤⣴⣿⣏⠁⠀⠀⠸⣏⢯⣷⣖⣦⡀⠀⠀⠀⠀⠀⠀\n" +
      "⢀⣾⣽⣿⣿⣿⣿⠛⢲⣶⣾⢉⡷⣿⣿⠵⣿⠀⠀⠀⠀⠀⠀\n" +
      "⣼⣿⠍⠉⣿⡭⠉⠙⢺⣇⣼⡏⠀⠀⠀⣄⢸⠀⠀⠀⠀⠀⠀\n" +
      "⣿⣿⣧⣀⣿.........⣀⣰⣏⣘⣆⣀⠀⠀",
    "⡿⢋⡿⠛⣡⣿⣿⡟⢉⣽⣟⢡⣿⣿⣿⣿⣿⣿⣿⡏⠰⠏⠽⠿⠿⣿⣿⣿⣿\n" +
      "⣶⠛⣀⣈⠩⠭⠤⠤⠴⢶⣶⣤⡐⢶⣶⣶⣶⣶⠆⣠⣶⠖⠒⠒⠒⠲⠦⣤⣤\n" +
      "⣤⣾⡟⣋⣠⡄⡀⣀⢀⡢⢌⣙⣿⡄⢻⣿⣿⠏⡸⠟⣩⢠⡀⠤⢠⡄⣲⣶⣿\n" +
      "⣿⡿⢷⣌⡛⠧⠤⠄⠘⣛⣂⣼⣿⡇⢠⣶⡆⠄⣿⡶⣦⣤⣤⣤⣴⣾⣿⣿⣿\n" +
      "⣿⣿⠦⠬⠉⠉⠙⠛⠿⣿⣿⣿⡟⠄⢹⣿⣿⡄⠸⣷⣦⣬⣭⣭⣤⣶⣶⣾⣿\n" +
      "⣿⣿⣿⣶⣶⣶⣶⣾⣿⣿⣿⠏⠄⠃⢸⣿⣿⣷⡄⠘⢿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
      "⣤⣉⡛⠛⠛⠛⠛⠛⠛⣋⠠⠂⣰⠁⣾⣿⣿⣿⣿⣄⠄⠙⠻⠿⠿⠿⠟⠛⣉\n" +
      "⣿⣿⠛⣿⣿⣿⣿⠿⢋⣤⡆⢸⣿⡀⢿⣿⣿⣿⣿⣿⠄⣶⣦⣄⡐⠲⣿⡋⣿\n" +
      "⣿⣿⡄⣿⣿⣿⠋⣴⣿⣿⣷⣤⣉⡑⠈⢻⣿⣿⠟⢉⣴⣿⣿⣿⣿⣦⠘⣷⣿\n" +
      "⣿⣿⠄⣿⣿⠇⣼⢿⣿⣿⣿⠿⠿⠿⠷⢤⣤⣤⠾⠿⠛⢛⣉⠉⡉⢻⡇⢸⣿\n" +
      "⣿⣿⡆⢻⣿⠐⠄⡂⢀⣀⢐⡒⢒⠒⢒⠒⡒⠒⡒⢚⡉⣁⠰⠠⢀⣾⠇⣼⣿\n" +
      "⣇⢻⣷⡈⢿⡇⢰⣌⡐⠨⢐⠛⠸⠇⠿⠇⠿⠸⠿⠘⣃⣩⡴⢁⣾⣿⣄⡟⢠\n" +
      "⣿⡄⣿⣿⡄⢻⣿⡟⢿⣷⣦⣌⡙⠻⠿⠿⠿⠿⠿⠟⠛⣋⣠⣾⣿⣿⣿⠃⡼\n" +
      "⣿⣷⣿⣿⣿⠈⣿⣿⣦⣌⢻⣿⣿⣿⣶⣶⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⣁⠊⣴",
  ],
  say = [
    "The wheels on the bus go round and round, round and round, round and round. The wheels on the bus go round and round, all through the town!",
    "Dibidi ba didi dou dou, Di ba didi dou, Didi didldildidldidl houdihoudi dey dou",
    "I like fuzzy kittycats, warm eyes, and pretending household appliances have feelings",
    "I've never seen the inside of my own mouth because it scares me to death.",
    "hee haw hee haw hee haw hee haw hee haw hee haw hee haw hee haw hee haw hee haw hee haw",
    "abcdefghijklmnopqrstuvwxyz abcdefghijklmnopqrstuvwxyz",
    "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaak",
    "eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo eyo",
  ],
  IMGs = [
    "static/img/cat-ceiling.jpg",
    "static/img/cat-crosseyes.jpg",
    "static/img/cat-hover.jpg",
    "static/img/cat-marshmellows.jpg",
    "static/img/nyan-cat.gif",
    "static/img/owo.jpg",
  ],
  AUDs = [
    "static/music/amogus.mp3",
    "static/music/sussy.mp3",
    "static/music/cf-gurls.mp3",
    "static/music/goofy.mp3",
  ],
  VIDs = [
    "static/video/boom.mp4",
    "static/video/noice.mp4",
    "static/video/rock.mp4",
  ];
export { ART, say, IMGs, AUDs, VIDs };
