const ART = [
    "{\\__/}\n" + "(●_●)\n" + "( > 🍪 Want a cookie?",
    "⠀⠀⠀⠀⠀⠀⠀⠀⢀⣞⣆⢀⣠⢶⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀\n" +
      "⠀⢀⣀⡤⠤⠖⠒⠋⠉⣉⠉⠹⢫⠾⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
      "⢠⡏⢰⡴⠀⠀⠀⠉⠙⠟⠃⠀⠀⠀⠈⠙⠦⣄⡀⢀⣀⣠⡤⠤⠶⠒⠒⢿⠋⠈⠀⣒⡒⠲⠤⣄⡀⠀⠀\n" +
      "⢸⠀⢸⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠀⠴⠂⣀⠀⠀⣴⡄⠉⢷⡄⠚⠀⢤⣒⠦⠉⠳⣄⡀⠀\n" +
      "⠸⡄⠼⠦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣄⡂⠠⣀⠐⠍⠂⠙⣆⠀\n" +
      "⠀⠙⠦⢄⣀⣀⣀⣀⡀⠀⢷⠀⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⡇⠠⣀⠱⠘⣧\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠈⠉⢷⣧⡄⢼⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⡈⠀⢄⢸⡄\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣿⡀⠃⠘⠂⠲⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠀⡈⢘⡇\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢫⡑⠣⠰⠀⢁⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⣸⠁\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣯⠂⡀⢨⠀⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡆⣾⡄⠀⠀⠀⠀⣀⠐⠁⡴⠁\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣧⡈⡀⢠⣧⣤⣀⣀⡀⢀⡀⠀⠀⢀⣼⣀⠉⡟⠀⢀⡀⠘⢓⣤⡞⠁\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢺⡁⢁⣸⡏⠀⠀⠀⠀⠁⠀⠉⠉⠁⠹⡟⢢⢱⠀⢸⣷⠶⠻⡇⠀⠀⠀\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⡏⠈⡟⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⢄⠁⠀⠻⣧⠀⠀⣹⠁⠀  \n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⡤⠚⠃⣰⣥⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⠼⢙⡷⡻⠀⡼⠁⠀⠀⠀\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠟⠿⡿⠕⠊⠉⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣶⣾⠉⣹⣷⣟⣚⣁⡼⠁⠀⠀⠀\n" +
      "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠙⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
    "⠀⠀⠀⠀⣠⣶⡾⠏⠉⠙⠳⢦⡀⠀⠀⠀⢠⠞⠉⠙⠲⡀⠀\n" +
      "⠀⠀⠀⣴⠿⠏⠀⠀⠀⠀⠀ ⠀⢳⡀⠀ ⡏⠀⠀⠀⠀⠀⢷\n" +
      "⠀⠀⢠⣟⣋⡀⢀⣀⣀⡀⠀⣀⡀⣧⠀⢸⠀⠀⠀⠀⠀ ⡇\n" +
      "  ⢸⣯⡭⠁⠸⣛⣟⠆⡴⣻⡲⣿ ⣸  OK   ⡇\n" +
      "⠀⠀⣟⣿⡭⠀⠀⠀⠀⠀⢱⠀⠀⣿⠀ ⢹⠀⠀⠀⠀⠀ ⡇\n" +
      "⠀⠀⠙⢿⣯⠄⠀⠀⠀⢀⡀⠀⠀⡿⠀⠀⡇⠀⠀⠀⠀⡼\n" +
      "⠀⠀⠀⠀⠹⣶⠆⠀⠀⠀⠀⠀⡴⠃⠀⠀⠘⠤⣄⣠⠞⠀\n" +
      "⠀⠀⠀⠀⠀⢸⣷⡦⢤⡤⢤⣞⣁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
      "⠀⠀⢀⣤⣴⣿⣏⠁⠀⠀⠸⣏⢯⣷⣖⣦⡀⠀⠀⠀⠀⠀⠀\n" +
      "⢀⣾⣽⣿⣿⣿⣿⠛⢲⣶⣾⢉⡷⣿⣿⠵⣿⠀⠀⠀⠀⠀⠀\n" +
      "⣼⣿⠍⠉⣿⡭⠉⠙⢺⣇⣼⡏⠀⠀⠀⣄⢸⠀⠀⠀⠀⠀⠀\n" +
      "⣿⣿⣧⣀⣿.........⣀⣰⣏⣘⣆⣀⠀⠀",
    "⡿⢋⡿⠛⣡⣿⣿⡟⢉⣽⣟⢡⣿⣿⣿⣿⣿⣿⣿⡏⠰⠏⠽⠿⠿⣿⣿⣿⣿\n" +
      "⣶⠛⣀⣈⠩⠭⠤⠤⠴⢶⣶⣤⡐⢶⣶⣶⣶⣶⠆⣠⣶⠖⠒⠒⠒⠲⠦⣤⣤\n" +
      "⣤⣾⡟⣋⣠⡄⡀⣀⢀⡢⢌⣙⣿⡄⢻⣿⣿⠏⡸⠟⣩⢠⡀⠤⢠⡄⣲⣶⣿\n" +
      "⣿⡿⢷⣌⡛⠧⠤⠄⠘⣛⣂⣼⣿⡇⢠⣶⡆⠄⣿⡶⣦⣤⣤⣤⣴⣾⣿⣿⣿\n" +
      "⣿⣿⠦⠬⠉⠉⠙⠛⠿⣿⣿⣿⡟⠄⢹⣿⣿⡄⠸⣷⣦⣬⣭⣭⣤⣶⣶⣾⣿\n" +
      "⣿⣿⣿⣶⣶⣶⣶⣾⣿⣿⣿⠏⠄⠃⢸⣿⣿⣷⡄⠘⢿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
      "⣤⣉⡛⠛⠛⠛⠛⠛⠛⣋⠠⠂⣰⠁⣾⣿⣿⣿⣿⣄⠄⠙⠻⠿⠿⠿⠟⠛⣉\n" +
      "⣿⣿⠛⣿⣿⣿⣿⠿⢋⣤⡆⢸⣿⡀⢿⣿⣿⣿⣿⣿⠄⣶⣦⣄⡐⠲⣿⡋⣿\n" +
      "⣿⣿⡄⣿⣿⣿⠋⣴⣿⣿⣷⣤⣉⡑⠈⢻⣿⣿⠟⢉⣴⣿⣿⣿⣿⣦⠘⣷⣿\n" +
      "⣿⣿⠄⣿⣿⠇⣼⢿⣿⣿⣿⠿⠿⠿⠷⢤⣤⣤⠾⠿⠛⢛⣉⠉⡉⢻⡇⢸⣿\n" +
      "⣿⣿⡆⢻⣿⠐⠄⡂⢀⣀⢐⡒⢒⠒⢒⠒⡒⠒⡒⢚⡉⣁⠰⠠⢀⣾⠇⣼⣿\n" +
      "⣇⢻⣷⡈⢿⡇⢰⣌⡐⠨⢐⠛⠸⠇⠿⠇⠿⠸⠿⠘⣃⣩⡴⢁⣾⣿⣄⡟⢠\n" +
      "⣿⡄⣿⣿⡄⢻⣿⡟⢿⣷⣦⣌⡙⠻⠿⠿⠿⠿⠿⠟⠛⣋⣠⣾⣿⣿⣿⠃⡼\n" +
      "⣿⣷⣿⣿⣿⠈⣿⣿⣦⣌⢻⣿⣿⣿⣶⣶⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⣁⠊⣴",
  ],
  enter = document.getElementById("enter"),
  show = document.getElementById("show"),
  random = (arr) => arr[Math.floor(Math.random() * arr.length)];
let screenOn;
window.onkeydown = (e) => {
  e.preventDefault();
  !screenOn ? start() : alert("Chunga bunga?");
};

function start() {
  if (!screenOn) screenOn = true;
  else return;

  alert("be ready");
  enter.style.opacity = "0";

  setInterval(() => {
    alert(random(ART));
  }, 3000);

  setTimeout(() => {
    document.body.removeChild(enter);
    document.body.classList.add("gay");
    show.style.display = "block";

    alert("wip, this site will be worse soon.");
    blockback();
    spam();
    vibrate();
  }, 500);
}

function blockback() {
  window.addEventListener("popstate", () => window.history.forward());
}
function music() {
  let audio = document.createElement("audio");
  audio.src = random(["static/music/amogus.mp3", "/static/music/sussy.mp3"]);
  audio.autoplay = true;
  audio.loop = true;

  document.body.appendChild(audio);

  // setInterval(() => {
  //   new Audio("/static/music/sussy.mp3").play();
  // }, 1000);
  //show.appendChild(document.createElement(<audio id="mySound" src="sound.mp3"></audio>));
}
function spam() {
  //fill history
  for (let i = 1; i < 20; i++) {
    window.history.pushState(
      {},
      "",
      window.location.pathname + "?suscount=" + i
    );
  }
  window.history.pushState({}, "", window.location.pathname);

  //theme color

  function zeroFill(width, number, pad = "0") {
    width -= number.toString().length;
    if (width > 0)
      return new Array(width + (/\./.test(number) ? 2 : 1)).join(pad) + number;
    return number + "";
  }

  // const meta = document.querySelector("meta.theme-color");
  // setInterval(() => {
  //   meta.setAttribute(
  //     "content",
  //     "#" + zeroFill(6, Math.floor(Math.random() * 16777215).toString(16))
  //   );
  // }, 50);
}
function vibrate() {
  if (typeof window.navigator.vibrate !== "function") return;
  setInterval(() => {
    const duration = Math.floor(Math.random() * 600);
    window.navigator.vibrate(duration);
  }, 1000);

  window.addEventListener("gamepadconnected", (event) => {
    const gamepad = event.gamepad;
    if (gamepad.vibrationActuator) {
      setInterval(() => {
        if (gamepad.connected) {
          gamepad.vibrationActuator.playEffect("dual-rumble", {
            duration: Math.floor(Math.random() * 600),
            strongMagnitude: Math.random(),
            weakMagnitude: Math.random(),
          });
        }
      }, 1000);
    }
  });
}
